<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b58f32391e5b89b600befb0903b5fb84c755abdc7cbbd5ff58f1a2a751ff145f","plan_job_ref":"Job Terraform plan #35 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132916342","plan_out_hash":"dfc7c1d92e351fe8d76a004bdca1911a51a60a36fdd1bc69979077e8a7befe3f","plan_hash":"9e92868ff63d1e85913d8d5e99aec029f3987d54d7703954b3a5aa3351df69a0","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                = "d4ef136o48bqjg3sv4q7"
        name              = "receive-video-handler"
        tags              = []
!~      user_hash         = "c613ae392e14fa798a414e7b305e37c1f233877677a4509a19abe4d008641be1" -> "febb005bbd548b4ada0936b267db84aca105012d502a479ad327f71e4bb485b2"
#        (10 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_message_queue.receive-video-handler-deadletter-queue will be created
+   resource "yandex_message_queue" "receive-video-handler-deadletter-queue" {
+       access_key                  = (sensitive value)
+       arn                         = (known after apply)
+       content_based_deduplication = false
+       delay_seconds               = 0
+       fifo_queue                  = false
+       id                          = (known after apply)
+       max_message_size            = 262144
+       message_retention_seconds   = 345600
+       name                        = "receive-video-handler-deadletter-queue"
+       receive_wait_time_seconds   = 0
+       region_id                   = "***********"
+       secret_key                  = (sensitive value)
+       visibility_timeout_seconds  = 30
    }

  # yandex_message_queue.receive-video-handler-queue will be created
+   resource "yandex_message_queue" "receive-video-handler-queue" {
+       access_key                  = (sensitive value)
+       arn                         = (known after apply)
+       content_based_deduplication = false
+       delay_seconds               = 0
+       fifo_queue                  = false
+       id                          = (known after apply)
+       max_message_size            = 262144
+       message_retention_seconds   = 1209600
+       name                        = "receive-video-handler-queue"
+       receive_wait_time_seconds   = 0
+       redrive_policy              = (known after apply)
+       region_id                   = "***********"
+       secret_key                  = (sensitive value)
+       visibility_timeout_seconds  = 10
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #20](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132916461)